In [29]:
import math
import numpy as np
import matplotlib as mpl
mpl.use('TkAgg')
import matplotlib.pyplot as plt
import pandas as pd
from sklearn.preprocessing import StandardScaler, MinMaxScaler
from scipy.spatial.distance import pdist,squareform

In [51]:
def Average(lst): 
    return sum(lst) / len(lst)

In [30]:
filePath = "../../../Dataset/credit_default_cleaned.csv"
df2 = pd.read_csv(filePath)

In [31]:
df2.head()

,limit,sex,education,status,age,ps-sep,ps-aug,ps-jul,ps-jun,ps-may,...,ba-jun,ba-may,ba-apr,pa-sep,pa-aug,pa-jul,pa-jun,pa-may,pa-apr,credit_default
0,50000,male,graduate school,single,25,2,0,0,0,0,...,49535,30358,30302,2130,1905,1811,1100,1100,1200,no
1,200000,male,university,married,54,-1,-1,-1,-1,-1,...,6335,4616,7956,10120,7852,6336,4622,7956,5499,no
2,30000,female,high school,married,39,2,3,2,2,2,...,30496,29731,29047,0,1700,1100,3,1053,1303,no
3,140000,female,university,single,31,0,0,0,0,0,...,25224,26855,23783,2000,2000,900,2000,10000,5000,no
4,60000,female,high school,married,36,1,2,2,0,0,...,48738,49601,52773,1788,0,1894,1801,3997,0,yes

In [33]:
df2 = df2.drop(["sex", "education", "status", "credit_default"], axis=1)

In [53]:
scaler = MinMaxScaler()  #normalization
df1 = scaler.fit_transform(df2.values)  #df1 is normalized
dist = squareform(pdist(df1,metric="euclidean")) #distance matrix
mean_values=list()
for k in range(3,100):
    for d in dist:
        index_kth_distance = np.argsort(d)[k]
        kth_distances.append(d[index_kth_distance])
    mean_values.append(Average(kth_distances))
plt.plot(range(0, len(mean_values)), sorted(mean_values))
plt.show()

/usr/lib/python3.7/site-packages/sklearn/utils/validation.py:590: DataConversionWarning: Data with input dtype int64 was converted to float64 by MinMaxScaler.
  warnings.warn(msg, DataConversionWarning)